[{"id":1,"name":"Slip","category":"Retail","year":2024,"icon":"img/icon_slip.svg","description":"is a digital receipt solution that eliminates paper clutter and simplifies how users track their purchases, taxes, and returns. By integrating directly with major retailers and point-of-sale systems, Slip provides a seamless experience from checkout to receipt management—all in one convenient platform.","why":"—In an age where physical slips are easily lost or damaged, Slip addresses the need for a secure, organized repository of transaction records. Whether tracking warranties or calculating expenses, users can quickly access real-time purchase data and maintain a clear overview of spending habits without rummaging through piles of paper.","how":"—By leveraging robust POS integration and a user-friendly interface, Slip empowers both consumers and retailers to transition from manual receipt handling to streamlined, digital workflows. Users enjoy instant access to their purchase history, while retailers benefit from reduced waste and improved customer satisfaction—all within a frictionless, modern system.","context":"Designed to streamline receipt management.","team":"Worked with developers and retail experts.","role":"Led UX/UI design and prototyping.","hidden":0,"media":[{"type":"image","src":"/img/prod/slip/S3+4col.png","alt":"S3 4col","class":"first-image"},{"type":"image","src":"/img/prod/slip/S3+2col.png","alt":"S3 2col","class":"img-2col"},{"type":"image","src":"/img/prod/slip/S3+1col.png","alt":"S3 1col","class":"img-1col"},{"type":"image","src":"/img/prod/slip/S3+1col2.png","alt":"S3 1col2","class":"img-1col"},{"type":"image","src":"/img/prod/slip/S3+3col.png","alt":"S3 3col","class":"img-3col"},{"type":"image","src":"/img/prod/slip/S3+1col3.png","alt":"S3 1col3","class":"img-1col"},{"type":"video","src":"/img/prod/ulife/ulife-scroll-profile.mp4","class":"video-3col match-1col"}],"order_position":0},{"id":2,"name":"Cornerstone","category":"Education","year":2024,"icon":"img/icon_cornerstone.svg","description":"is a generative AI-powered solution from Cornerstone OnDemand that delivers personalized learning and development experiences. By analyzing individual skill gaps and career aspirations, the platform offers tailored recommendations, real-time guidance, and relevant resources to help employees grow in their roles.","why":"—In a workplace where continuous upskilling is crucial, Companion addresses the need for individualized support and efficient learning pathways. Rather than relying on static, one-size-fits-all content libraries, it harnesses AI to dynamically surface the most impactful training for each user, enabling organizations to boost productivity and engagement across teams.","how":"—The platform integrates seamlessly into existing workflows by analyzing data from performance reviews, role responsibilities, and learner preferences. Employees benefit from real-time skill-gap detection, while administrators can track engagement, configure learning paths, and measure program effectiveness—all within an intuitive, results-driven interface.","context":"Built for Cornerstone OnDemand.","team":"Collaborated with AI engineers and educators.","role":"Designed the user interface and experience.","hidden":0,"media":[{"type":"image","src":"/img/prod/cornerstone/Cornerstone-Cover.png","alt":"S4 4col","class":"first-image"},{"type":"video","src":"/img/prod/cornerstone/ConnectLive-FinalDelivery.mov","class":"video-4col"},{"type":"image","src":"/img/prod/cornerstone/Cornerstone-mobile.jpg","alt":"S4 1col","class":"img-1col"},{"type":"image","src":"/img/prod/cornerstone/Cornerstone-desktop.jpg","alt":"S4 4col","class":"img-3col match-1col"}],"order_position":1},{"id":10,"name":"Nuvie","category":"Healthcare","year":2023,"icon":"img/icon_nuvie.svg","description":"is a voice-recognition platform that streamlines clinical documentation by automatically processing prescriptions, lab tests, and other key data from patient-doctor conversations. This approach significantly optimizes provider time by eliminating paperwork and ensures accurate, automated coding to reduce claim denials.","why":"—This solution tackles the massive challenge of physician time spent on paperwork—estimated at over $200 billion annually—while also reducing claim denials through accurate, automated documentation and coding. Ultimately, Nuvie gives physicians more face time with patients while improving operational efficiency for healthcare organizations.","how":"—In leading Nuvie’s design, I worked closely with physicians, administrators, and compliance teams to integrate seamless voice transcription for prescriptions, lab orders, and billing codes directly into existing EHR systems. This approach significantly optimizes provider time by eliminating paperwork and ensures accurate, automated coding to reduce claim denials.","context":"Developed for healthcare providers.","team":"Team of doctors and designers.","role":"UI/UX lead.","hidden":0,"media":[{"type":"image","src":"/img/prod/nuvie/nuvie-cover.png","alt":"S7 4col","class":"first-image"},{"type":"image","src":"/img/prod/nuvie/S7+2col+1.png","alt":"S7 2col 1","class":"img-2col"},{"type":"image","src":"/img/prod/nuvie/S7+2col+2.png","alt":"S7 2col 2","class":"img-2col"},{"type":"image","src":"/img/prod/nuvie/S7+3col.png","alt":"S7 3col","class":"img-3col match-1col"},{"type":"image","src":"/img/prod/nuvie/S7+1col3.png","alt":"S7 1col3","class":"img-1col"},{"type":"video","src":"/img/prod/ulife/ulife-scroll-profile.mp4","class":"video-1col"}],"order_position":2},{"id":8,"name":"Maria","category":"Healthcare","year":2023,"icon":"img/icon_maria.svg","description":"is a GenAI-driven health agent that redefines primary care by connecting patients with doctors, nutritionists, and psychologists through asynchronous conversations. This platform autonomously handles triage, streamlines case management, and automates over 50% of patient interactions, significantly boosting provider capacity.","why":"—By minimizing the manual workload of traditional telemedicine and in-person visits, Maria addresses the critical bottleneck of limited provider availability and prolonged wait times. Thanks to its efficient case handling, Maria has achieved a 98% customer satisfaction score (CSAT) and an 87% resolution rate—enabling physicians to manage up to ten times more patient interactions.","how":"—In designing Maria’s workflow, I introduced a dynamic triage process driven by adaptive AI, implemented clear escalation paths for complex cases, and refined user interfaces to guide patients seamlessly. These innovations not only reduce friction for both patients and providers but also ensure swift, accurate handoffs when human expertise is needed.","context":"Redefining primary care with AI.","team":"Collaborated with healthcare professionals and AI specialists.","role":"Designed workflow and user interfaces.","hidden":0,"media":[{"type":"image","src":"/img/prod/maria/maria-cover.png","alt":"S8 4col","class":"first-image"},{"type":"video","src":"/img/prod/maria/Maria-heart-pumping-3.mov","class":"video-4col"},{"type":"image","src":"/img/prod/maria/maria-desktop.png","alt":"S8 4col","class":"img-4col"},{"type":"image","src":"/img/prod/maria/maria-branding.png","alt":"S8 4col","class":"img-4col"},{"type":"image","src":"/img/prod/maria/maria-product.png","alt":"S8 4col","class":"img-4col"},{"type":"image","src":"/img/prod/maria/Maria-app-medications.png","alt":"S8 1col a","class":"img-1col"},{"type":"image","src":"/img/prod/maria/maria-app-nutrition.png","alt":"S8 1col a","class":"img-1col"},{"type":"lottie","src":"/img/prod/maria/maria_heart_Pumping.json","class":"lottie-container","data-preserve-aspect":"xMidYMid slice","style":"background: #F9F;"},{"type":"image","src":"/img/prod/maria/maria-app-record.png","alt":"S8 1col a","class":"img-1col"},{"type":"image","src":"/img/prod/maria/maria-app-Scheduling.png","alt":"S8 1col a","class":"img-1col"},{"type":"image","src":"/img/prod/maria/maria-hearts.png","alt":"S8 2col","class":"img-2col"},{"type":"image","src":"/img/prod/maria/maria-heart-bag.png","alt":"S8 2col","class":"img-2col"},{"type":"image","src":"/img/prod/maria/maria-graphics.png","alt":"S8 4col","class":"img-4col"},{"type":"image","src":"/img/prod/maria/maria-social.png","alt":"S8 4col","class":"img-4col"}],"order_position":3},{"id":9,"name":"Positiv","category":"Wellness","year":2019,"icon":"img/icon_positiv.png","description":"is a wellness app—five-time App of the Day in the Apple Store Brazil—that brings calm to a fast-paced world through a smooth, animated interface designed to soothe the mind. Offering meditations, sleep stories, and self-development courses, Positiv now integrates multimodal Large Language Models (LLMs) to deliver real-time, personalized guided meditations in multiple languages.","why":"—By emphasizing the proven benefits of mindfulness for mental well-being—such as reduced stress, improved emotional regulation, and better sleep—Positiv addresses a fundamental need in modern life: finding balance amidst constant demands. This focus on mental health is strengthened through stress-level assessments and continuous tracking of progress, providing valuable insights into each user’s unique journey.","how":"—In building Positiv’s platform, I introduced interactive, gamified elements—like streaks and goal achievements—to keep users motivated while integrating adaptive meditation flows that evolve based on real-time feedback. With these innovations, Positiv seamlessly combines ease of use, personalized guidance, and engaging challenges, making mindfulness both accessible and impactful for users across diverse backgrounds and lifestyles.","context":"Five-time App of the Day in Apple Store Brazil.","team":"Collaborated with wellness experts and developers.","role":"Designed the animated interface and gamified features.","hidden":0,"media":[{"type":"image","src":"/img/prod/positiv/positiv-cover.png","alt":"S6 4col","class":"first-image"},{"type":"image","src":"/img/prod/positiv/S6+1col.png","alt":"S6 1col","class":"img-1col"},{"type":"image","src":"/img/prod/positiv/S6+2col+match.png","alt":"S6 2col match","class":"img-2col match-1col"},{"type":"image","src":"/img/prod/positiv/S6+1col2.png","alt":"S6 1col2","class":"img-1col"},{"type":"image","src":"/img/prod/positiv/S6+3col.png","alt":"S6 3col","class":"img-3col match-1col"},{"type":"image","src":"/img/prod/positiv/S6+1col3.png","alt":"S6 1col3","class":"img-1col"},{"type":"video","src":"/img/prod/ulife/ulife-scroll-profile.mp4","class":"video-4col"}],"order_position":4},{"id":3,"name":"Walls","category":"Art","year":2016,"icon":"img/icon_walls.svg","description":"is a platform dedicated to mapping every piece of street art across the city, offering curated walking tours and enabling users to purchase digital collectibles, including videos and NFTs from featured artists. By transforming urban canvases into interactive experiences, Walls celebrates creativity in every corner of the neighborhood.","why":"—In an era where street art is often fleeting and underrecognized, Walls addresses the need to preserve and promote these vibrant expressions. Through meticulously crafted walking routes, visitors can explore hidden murals, learn about local talent, and support artists directly—bridging the gap between street art enthusiasts, tourists, and the creators themselves.","how":"—The platform combines geolocation technology with a seamless digital marketplace, allowing users to discover nearby artworks and collect exclusive digital content tied to each piece. Artists benefit from broader exposure and opportunities to monetize their craft, while street art aficionados enjoy a richer, more connected experience that transcends physical walls.","context":"Celebrating urban creativity.","team":"Worked with artists and tech developers.","role":"Designed the geolocation and marketplace features.","hidden":0,"media":[{"type":"image","src":"/img/prod/walls/S2+4col.png","alt":"S2 4col","class":"first-image"},{"type":"image","src":"/img/prod/walls/S2+1col.png","alt":"S2 1col","class":"img-1col"},{"type":"image","src":"/img/prod/walls/S2+1col2.png","alt":"S2 1col2","class":"img-1col"},{"type":"image","src":"/img/prod/walls/S2+2col.png","alt":"S2 2col","class":"img-2col"},{"type":"image","src":"/img/prod/walls/S2+3col.png","alt":"S2 3col","class":"img-3col"},{"type":"image","src":"/img/prod/walls/S2+1col+filler.png","alt":"S2 1col filler","class":"img-1col"},{"type":"video","src":"/img/prod/ulife/ulife-scroll-profile.mp4","class":"video-2col"}],"order_position":5},{"id":4,"name":"Ulife","category":"Education","year":2015,"icon":"img/icon_ulife.svg","description":"redefines lifelong learning with its cutting-edge platform, supporting students and educators in seamlessly managing their educational journey from academia to the professional world. A highlight of this pioneering app is the Life Watch, a tool that visually organizes a student’s potential 100-year lifespan into weeks, offering a strategic overview of their learning trajectory.","why":"—By extending the student’s relationship with their university well beyond the typical four-year course, Ulife becomes the central place that maps and structures all types of knowledge—whether formal, informal, or derived from personal and professional experiences. This holistic approach enables continuous engagement and development, ensuring learning doesn’t end at graduation.","how":"—In crafting Ulife’s platform, I integrated a user-friendly interface for the Life Watch feature, streamlined knowledge management, and implemented collaborative tools for educators and learners. These innovations empower users to track progress, continuously enhance their skill set, and stay connected to their educational journey over a lifetime.","context":"Redefining lifelong learning.","team":"Collaborated with educators and developers.","role":"Designed the Life Watch and collaborative tools.","hidden":0,"media":[{"type":"image","src":"/img/prod/ulife/ulife-cover.png","alt":"S5 4col","class":"first-image"},{"type":"image","src":"/img/prod/ulife/Ulife-desktop.png","alt":"S5 4col","class":"img-4col"},{"type":"image","src":"/img/prod/ulife/Ulife-logo.png","alt":"S5 4col","class":"img-2col"},{"type":"video","src":"/img/prod/ulife/ulife-intro.mov","class":"video-2col"},{"type":"image","src":"/img/prod/ulife/ulife-dashboards.jpg","alt":"S5 4col","class":"img-4col"},{"type":"video","src":"/img/prod/ulife/ulife-profile.mp4","class":"video-1col"},{"type":"video","src":"/img/prod/ulife/Ulife-lifewatch.mp4","class":"video-1col"},{"type":"video","src":"/img/prod/ulife/ulife-course.mp4","class":"video-1col"},{"type":"video","src":"/img/prod/ulife/ulife-activity.mp4","class":"video-1col"},{"type":"image","src":"/img/prod/ulife/Ulife-Chat.png","alt":"S5 4col","class":"img-4col"},{"type":"image","src":"/img/prod/ulife/Ulife-Search.jpg","alt":"S5 4col","class":"img-4col"},{"type":"image","src":"/img/prod/ulife/ulife-Branding.png","alt":"S5 4col","class":"img-4col"}],"order_position":6},{"id":5,"name":"Rico","category":"Finance","year":2014,"icon":"img/icon_rico.svg","description":"—meaning “rich” in Portuguese—embodies a brokerage experience built for every kind of investor, from beginners to seasoned traders. As part of XP Investments in Brazil, Rico provides an extensive suite of financial products, spanning fixed-income securities, equities, and full wealth management solutions.","why":"—Recognizing that “wealth” carries different meanings—be it financial security, opportunity, or influence—Rico’s design emphasizes simplicity and clarity. The interface streamlines portfolio management with intuitive charts, enabling quick insights into asset allocation, real-time stock market performance, and easy-to-use features for buying and selling. By minimizing complexity, Rico helps bridge the knowledge gap and empowers investors to make informed decisions.","how":"—In crafting this platform, I integrated color-coded buy/sell pages to prevent errors, live-streamed market updates for timely insights, and detailed stock views that highlight essential metrics like dividend yield and price-to-earnings ratios. These enhancements ensure investors have all the tools they need—whether they’re monitoring a straightforward retirement account or actively trading diverse portfolios—while enjoying a clean, engaging user experience tailored to the modern market.","context":"Built for XP Investments in Brazil.","team":"Collaborated with financial experts and developers.","role":"Designed the interface and trading features.","hidden":0,"media":[{"type":"image","src":"/img/prod/rico/Rico-Cover.png","alt":"Rico 4col","class":"first-image"},{"type":"image","src":"/img/prod/rico/Rico+2col.png","alt":"Rico 2col","class":"img-2col"}],"order_position":7},{"id":6,"name":"Newsmonitor","category":"Information","year":2011,"icon":"img/icon_newsmonitor.svg","description":"was a pioneering platform that aggregated millions of news articles daily and categorized them through advanced machine learning. By employing semantic analysis, it identified when multiple stories covered the same topic—even if phrased differently—transforming the platform into a powerful market research tool. This success culminated in NewsMonitor’s acquisition by Knewin in December 2020.","why":"—In an era of skyrocketing media consumption, the platform's mission was to simplify the process of news discovery and correlation across diverse sources. NewsMonitor offered real-time search and subscription alerts for specific terms, and allowed users to curate clippings that could be shared via email or PDF—making it easier to stay informed and spot emerging trends quickly.","how":"—The design process centered on intuitive interfaces, refined semantic grouping, and user-friendly features such as instant notifications and personalized recommendations. This holistic approach brought clarity to overwhelming amounts of information, ensuring NewsMonitor addressed the growing need for efficient, on-demand media intelligence.","context":"Acquired by Knewin in December 2020.","team":"Worked with data scientists and designers.","role":"Designed the interface and recommendation system.","hidden":0,"media":[{"type":"image","src":"/img/prod/newsmonitor/newsmonitor-cover.png","alt":"S9 4col","class":"first-image"},{"type":"image","src":"/img/prod/newsmonitor/newsmonitor-desktop.png","alt":"S4 4col","class":"img-4col"},{"type":"image","src":"/img/prod/newsmonitor/newsmonitor-desktop2.png","alt":"S4 4col","class":"img-4col"},{"type":"image","src":"/img/prod/newsmonitor/newsmonitor-desktop3.png","alt":"S4 4col","class":"img-4col"}],"order_position":8},{"id":7,"name":"Vot","category":"Government","year":2009,"icon":"img/icon_vot.svg","description":"was a platform designed to bring people closer to legislative discussions in Brazil by displaying active bills from the National Congress. Users were able to read summarized proposals, vote for or against them, and leave comments, creating a direct link between citizens and lawmakers. As a result, Vot served as a conduit for enhanced transparency and democratic engagement.","why":"—In a political climate where public participation was often limited, Vot addressed the growing need for accessible and understandable legislative information. By facilitating real-time feedback on proposed laws, the platform empowered citizens to voice their opinions and fostered a climate of accountability for representatives.","how":"—Its intuitive design highlighted key points of each bill, enabling quick overviews and straightforward voting. Users could also track ongoing legislative processes, compare community sentiment on various proposals, and share their insights publicly or directly with representatives. These features collectively nurtured a more engaged and informed society, bridging the divide between policy-making and the everyday citizen.","context":"Enhanced transparency in Brazilian legislation.","team":"Collaborated with civic tech experts.","role":"Designed the bill summary and voting interface.","hidden":0,"media":[{"type":"image","src":"/img/prod/vot/vot-cover.jpg","alt":"S1 4col","class":"first-image"},{"type":"image","src":"/img/prod/vot/vot-cards.jpg","alt":"S1 4col","class":"img-4col"},{"type":"image","src":"/img/prod/vot/vot-maps.jpg","alt":"S1 4col","class":"img-4col"},{"type":"image","src":"/img/prod/vot/S1+2col+match.png","alt":"S1 2col match","class":"img-2col match-1col"},{"type":"image","src":"/img/prod/vot/S1+1col2.png","alt":"S1 1col2","class":"img-1col"},{"type":"image","src":"/img/prod/vot/S1+3col+match.png","alt":"S1 3col match","class":"img-3col match-1col"},{"type":"image","src":"/img/prod/vot/S1+1col3.png","alt":"S1 1col3","class":"img-1col"},{"type":"video","src":"/img/prod/ulife/ulife-scroll-profile.mp4","class":"video-4col"}],"order_position":9}]